{
  "index": {
    "title": "Hello, I'm Emerson",
    "description": "Passionate about technology, I hold a degree in Computer Science and specialize in frontend development.",
    "switch": "pt-BR",
    "header": {
      "about": "About",
      "experience": "Experience",
      "education": "Education",
      "projects": "Projects",
      "contact": "Contact"
    },
    "experience": {
      "crescer": "<div>Participated in a developer training project where I spent 3 months studying at the company, with a total of 30 people:</div>\n<li> Learned technologies and concepts such as OOP, Databases, JavaScript, React, Java, among others.</li>\n<li> Delivered applications every week for 3 months, such as: Social Network, Pokedex, Uber-like.</li>\n<li> Participated in groups with 3 different people every week.</li>\n<div>As a final project, where myself and 3 other colleagues, we developed a game in ReactJS and Java, with motion detection by camera called Hole in the wall, where the player had to assume a certain body position to pass through the obstacle that was coming towards him/her.</div>\n<li> Managed and led the frontend part of the project.</li>\n<li> Implemented motion detection by camera (see images below).</li>\n<li> Applied music (.mp3) during the game.</li>\n<li> Experienced participating in an evaluating panel as a judge.</li>",
      "junior": "<li>Developed landing pages for Ford trucks.</li>\n<li>Resolved bugs in the web project.</li>",
      "senior": "<div>Experience divided by clients:</div><div>Kopp (Traffic Solutions) - React/Next</div>\n<li>Participated in the project kickoff discussing frontend technology structure and architecture.</li>\n<li>Developed web applications using JavaScript, React, Next.js, Webpack, CSS3, HTML5, Jest, and Typescript.</li>\n<li>Implemented communication via Websockets.</li>\n<li>Implemented mobile support with PWA and TWA.</li>\n<li>Implemented sound alerts (.mp3).</li>\n<li>Participated in daily client meetings.</li>\n<div>BV (Banco Votorantim) - Flutter/Kotlin/Swift</div>\n<li>Developed features for the 'Save Money' section of the app.</li>\n<li>Participated in the 'Private' project, an app exclusive for selected clients.</li>\n<li>Managed deployment processes for Android and iOS.</li>\n<li>Created clean architecture documentation in Flutter.</li>\n<li>Participated in the 'CRM' team, applying push notification solutions with Salesforce.</li>\n<div>Crescer (Employee Training Project) - React</div>\n<li>Delivered classes on React performance, utilizing useMemo and useCallback.</li>\n<li>Participated as a monitor, assisting students with React-related doubts.</li>\n<li>Evaluated students' React projects within the project.</li>\n<li>Participated in the final project panel.</li>\n<div>GPA (Grupo Pão de Açúcar) - React/React Native</div>\n<li>Developed components for the project's storybook.</li>\n<li>Resolved blocking bugs.</li>\n<li>Participated in client meetings.</li>\n<div>Sumicity (Internet Packages/Marketplace) - React</div>\n<li>Participated in the project kickoff discussing frontend technology structure and architecture.</li>\n<li>Developed web applications using JavaScript, React, HTML, CSS, Webpack, Maps.</li>\n<li>Enhanced performance concepts with Memos in React.</li>\n<li>Developed a system for map usage using Leaflet.</li>\n<li>Trained new team members.</li>\n<li>Developed a CRM for internet package management in the Marketplace.</li>\n<li>Managed application deploys to production.</li>\n<li>Created React libraries with Rollup.</li>\n<li>Created documentation.</li>\n<li>Participated in client solution presentations.</li>",
      "showMoreLessButton": {
        "more": "Show more",
        "less": "Show less"
      }
    },
    "education": {
      "badge": {
        "ulbra": "Bachelor's Degree in Computer Science",
        "uptime": "English as a Second Language Course",
        "qi": "Technical Education in IT"
      }
    },
    "contact": {
      "title": "Contact"
    },
    "projects": {
      "crescer": {
        "description": "<h1>Monitorship in Crescer Project</h1><image>/images/aula-crescer.png</image><p>Through the same project which I joined the company as a student, I later had the opportunity to work in it as a monitor and instructor.</p><p>Initially, as a monitor, I assisted students with doubts regarding React.js, corrected and evaluated applications made by them, but demanded by the instructors.</p><p>Soon after, I had the chance to participate in the project as an instructor, where I had all the responsibilities of the monitors' tasks, but also demonstrated some React.js concepts to the students through classes.</p><p>At the end of the modules, we participated in panels to evaluate the students who best embraced the technology's knowledge.</p><image>/images/aula-crescer2.png</image>",
        "carousel": {
          "title": "Crescer Project Monitoring",
          "description": "Training project for new company employees."
        }
      },
      "crescer-final": {
        "description": "<h1>Final Project of the Crescer Project</h1><image>/images/wall.png</image><p>I participated in a developer training project where I spent 3 months studying at the company, with a total of 30 people.</p><image>/images/model.png</image><li> I learned technologies and concepts such as OOP, Databases, JavaScript, React, Java, among others.</li>\n<li> I delivered applications every week for 3 months, such as: Social Network, Pokedex, Uber-like.</li>\n<li> I participated in groups with 3 different people every week.</li><p>As a final project, where myself and 3 other colleagues, we developed a game in ReactJS and Java, with motion detection by camera called Hole in the wall, where the player had to make a certain body position to pass through the obstacle that was coming towards them.</p>\n<li> I managed and led the frontend part of the project.</li>\n<li> I implemented motion detection by camera (see images below).<image>/images/model-person.png</image></li>\n<li> I applied music (.mp3) during the game.</li>\n<li> I experienced participating in an evaluating panel as a judge.</li>",
        "carousel": {
          "title": "Final Project of the Crescer Project",
          "description": "As a final project, we developed a game in ReactJS and Java, with motion detection by camera called Hole in the wall, where the player had to assume a certain body position to pass through the obstacle that was coming towards him/her."
        }
      },
      "tcc": {
        "description": "<h1>Board Game Online</h1><image>/images/tcc.png</image><p>Developed as the final project of college, I implemented a multiplayer online virtual board game, inspired by the physical game Zombicide 2nd Edition. The application has a series of features, such as: moving players, collecting and using items, rolling dice, and killing zombies.</p><image>/images/poster.png</image>",
        "carousel": {
          "title": "College Final Project",
          "description": "I implemented an online multiplayer virtual board game, inspired by the physical game Zombicide 2nd Edition, as my college final project. The application features various functionalities such as moving players, collecting and using items, rolling dice, and killing zombies."
        }
      }
    }
  }
}