{
  "index": {
    "title": "Olá, sou Emerson",
    "description": "Apaixonado por tecnologia, sou formado em ciência da computação e especialista em frontend.",
    "switch": "en",
    "header": {
      "about": "Sobre",
      "experience": "Experiência",
      "projects": "Projetos"
    },
    "experience": {
      "crescer": "<div>Participei de um projeto de capacitação de desenvolvedores onde passei 3 meses estudando na empresa, com um total de 30 pessoas:</div>\n<li> Aprendi tecnologias e conceitos como POO, Banco de Dados, JavaScript, React, Java entre outros.</li>\n<li> Entreguei aplicações todas as semanas durante 3 meses, como (Rede Social, Pokedex, Uber-like).</li>\n<li> Participei de grupos com 3 pessoas diferentes todas as semanas.</li>\n<div>Como projeto final, onde eu e mais 3 colegas, desenvolvemos um jogo em ReactJS e Java, com detecção de movimentos por câmera chamado (Hole in the wall), onde o jogador tinha que fazer uma certa posição com o corpo para poder passar pelo obstáculo que estava vindo até ele.</div>\n<li> Gerenciei e liderei a parte de frontend do projeto.</li>\n<li> Implementei leitura de movimentos por câmera (segue imagens abaixo).</li>\n<li> Apliquei músicas (.mp3) durante o jogo.</li>\n<li> Experienciei participar de uma banca avaliadora como julgado.</li>",
      "junior": "<li>Desenvolvi landing pages para Ford caminhões.</li>\n<li>Resolvi bugs do projeto web.</li>",
      "senior": "Experiência dividida por clientes:\nKopp (Soluções para trânsito) - React/Next\n<li> Participei do início do projeto discutindo estrutura e arquitetura das tecnologias de frontend.</li>\n<li> Desenvolvi aplicações web usando JavaScript, React, Next.js, Webpack, CSS3, HTML5, Jest e Typescript.</li>\n<li> Implementei comunicação via Websockets.</li>\n<li> Implementei suporte mobile com PWA e TWA.</li>\n<li> Implementei alertas sonoros (.mp3).</li>\n<li> Participei de conversas diárias com o cliente.</li>\n\nBV (Banco Votorantim) - Flutter/Kotlin/Swift\n<li> Desenvolvi features para a seção 'Guardar' do app.</li>\n<li> Participei do projeto 'Private', app exclusivo para clientes selecionados.</li>\n<li> Geri processos de deploy para android e ios.</li>\n<li> Criei documentações de arquitetura clean em Flutter.</li>\n<li> Participei da equipe de 'CRM', aplicando soluções de push notification com Salesforce.</li>\n\nCrescer (Projeto de capacitação de novos colaboradores da empresa) - React\n<li> Ministrei aulas sobre performance em React, utilizando useMemo e useCallback.</li>\n<li> Participei como monitor ajudando alunos com dúvidas sobre React.</li>\n<li> Avaliei projetos React dos alunos do projeto.</li>\n<li> Participei da banca final do projeto.</li>\n\nGPA (Grupo Pão de Açucar) - React/React Native\n<li> Desenvolvi componentes para o storybook do projeto.</li>\n<li> Resolvi bugs impeditivos.</li>\n<li> Participei de reuniões com o cliente.</li>\n\nSumicity (Pacotes de internet/Marketplace) - React\n<li> Participei do início do projeto discutindo estrutura e arquitetura das tecnologias de frontend.</li>\n<li> Desenvolvi aplicações web usando Javascript, React, HTML, CSS, Webpack, Maps.</li>\n<li> Aperfeiçoei conceitos de performance com Memos no React.</li>\n<li> Desenvolvi um sistema para a utilização de mapas usando Leaflet.</li>\n<li> Intruí novos colaboradores da equipe.</li>\n<li> Desenvolvi um CRM para gerenciamento de pacotes de internet no Marketplace.</li>\n<li> Gerenciei deploys da aplicação para produção.</li>\n<li> Criei bibliotecas React com Rollup.</li>\n<li> Criei documentações.</li>\n<li> Participei de apresentações de soluções para o cliente.</li>"
    }
  }
}